window.ZHUGE = {
    'A01' : {'action': '打开首页'},
    //	   {'status': '查询-前端失败', 'msg': 'city_name'}
    //	   {'status': '查询-前端失败', 'msg': 'start_date'}
    //	   {'status': '查询-前端失败', 'msg': 'people_num'}
    'A02' : {'action': '查询场地'},
    'A03' : {'status': '查询-前端失败'},
    'A04' : {'action': '查询-热门城市'},

    'A05' : {'action': '获取报价', 'tag': '热门城市'},
    'A06' : {'status': '报价-前端失败', 'tag': '热门城市', 'msg': '未填写手机号码'},
    'A07' : {'status': '报价-前端失败', 'tag': '热门城市', 'msg': '手机号码格式不正确'},

    'A08' : {'status': '报价-后端成功', 'tag': '热门城市'},
    'A09' : {'status': '报价-后端失败', 'tag': '热门城市'},

    'A10' : {'action': '被拦截', 'tag': '热门城市'},

    'A12' : {'action': '查询-小城市'},
    'A13' : {'action': '获取报价', 'tag': '小城市'},
    'A14' : {'status': '报价-前端失败', 'tag': '小城市', 'msg': '未填写手机号码'},
    'A15' : {'status': '报价-前端失败', 'tag': '小城市', 'msg': '手机号码格式不正确'},
    'A16' : {'status': '报价-前端失败', 'tag': '小城市', 'msg': '未填写数字验证码'},
    'A17' : {'status': '报价-前端失败', 'tag': '小城市', 'msg': '数字验证码不正确'},
    'A18' : {'status': '报价-前端失败', 'tag': '小城市', 'msg': '未填写短信验证码'},

    'A19' : {'status': '报价-后端成功', 'tag': '小城市'},
    'A20' : {'status': '报价-后端失败', 'tag': '小城市'},

    'A21' : {'action': '获取验证码-失败', 'tag': '小城市', 'msg': '未填写手机号码'},
    'A22' : {'action': '获取验证码-失败', 'tag': '小城市', 'msg': '手机号码格式不正确'},
    'A23' : {'action': '获取验证码-失败', 'tag': '小城市', 'msg': '未填写数字验证码'},
    'A24' : {'action': '获取验证码-失败', 'tag': '小城市', 'msg': '数字验证码不正确'},


    'B14' : {'status': '报价-前端失败', 'tag': '热门城市', 'msg': '未填写手机号码'},
    'B15' : {'status': '报价-前端失败', 'tag': '热门城市', 'msg': '手机号码格式不正确'},
    'B16' : {'status': '报价-前端失败', 'tag': '热门城市', 'msg': '未填写数字验证码'},
    'B17' : {'status': '报价-前端失败', 'tag': '热门城市', 'msg': '数字验证码不正确'},
    'B18' : {'status': '报价-前端失败', 'tag': '热门城市', 'msg': '未填写短信验证码'},

    'B19' : {'status': '报价-后端成功', 'tag': '热门城市'},
    'B20' : {'status': '报价-后端失败', 'tag': '热门城市'},
    'B21' : {'action': '获取验证码-失败', 'tag': '热门城市', 'msg': '未填写手机号码'},
    'B22' : {'action': '获取验证码-失败', 'tag': '热门城市', 'msg': '手机号码格式不正确'},
    'B23' : {'action': '获取验证码-失败', 'tag': '热门城市', 'msg': '未填写数字验证码'},
    'B24' : {'action': '获取验证码-失败', 'tag': '热门城市', 'msg': '数字验证码不正确'},
};

var zg = function (key, obj) {
    if (ZHUGE[key]) {
        var title = JSDATA.source_tags;
        var opts = obj ? $.extend(ZHUGE[key], obj) : ZHUGE[key];
        hggtrack.track(title, opts);
    }
};